In [2]:
#Import Pandas

In [72]:
import pandas as pd

In [73]:
# Create three series with the following info
"""
{
    'Name': 'Alice',
    'Class': 'Physics',
    'Score': 85
}

{
    'Name': 'Jack',
    'Class': 'Chemistry',
    'Score': 82
}

{
    'Name': 'Helen',
    'Class': 'Biology',
    'Score': 90
}
"""
# Then, pass in all 3 series into a new dataframe with the indices set as
# school1, school2, school1

"\n{\n    'Name': 'Alice',\n    'Class': 'Physics',\n    'Score': 85\n}\n\n{\n    'Name': 'Jack',\n    'Class': 'Chemistry',\n    'Score': 82\n}\n\n{\n    'Name': 'Helen',\n    'Class': 'Biology',\n    'Score': 90\n}\n"

In [74]:
s1 = pd.Series({
    'Name': 'Alice',
    'Class': 'Physics',
    'Score': 85
})

s2 = pd.Series({
    'Name': 'Jack',
    'Class': 'Chemistry',
    'Score': 82
})

s3 = pd.Series({
    'Name': 'Helen',
    'Class': 'Biology',
    'Score': 90
})

df = pd.DataFrame([s1, s2, s3], index=["school1", "school2", "school1"])
df

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82
school1  Helen    Biology     90

In [75]:
# Do the same as above, but inject the values straight into the dataframe

In [76]:
df = pd.DataFrame([{
    'Name': 'Alice',
    'Class': 'Physics',
    'Score': 85
}, {
    'Name': 'Jack',
    'Class': 'Chemistry',
    'Score': 82
}, {
    'Name': 'Helen',
    'Class': 'Biology',
    'Score': 90
}], index=["School1", "School2", "School1"])
df

          Name      Class  Score
School1  Alice    Physics     85
School2   Jack  Chemistry     82
School1  Helen    Biology     90

In [77]:
# Return the second entry, School2, as a series
# QUESTION: If you do the same with School1, what would you get back and why?

In [78]:
df.loc['School2']
# You would get back a data frame since there are two entries 
# which use the school1 entry

Name          Jack
Class    Chemistry
Score           82
Name: School2, dtype: object

In [79]:
# Turn all the rows into columns and all the columns into rows in our previous 
# Data frame

In [104]:
df.T

              School1 School2 School1
Score              85      82      90
Class ranking    None    None    None

In [81]:
# Using the data frame above, extract all the names in school1 using chaining
# QUESTION: What would the same command look like for school2 and why

In [82]:
df.loc['School1']['Name']
# It would look like just "jack", since there is only one name in school2

School1    Alice
School1    Helen
Name: Name, dtype: object

In [83]:
# Get all the names and scores for all schools using the loc attribute as a DF, 
# without chaining
# Hint: How would you get every value inside a [] operator?

In [84]:
df.loc[:, ["Name", "Score"]]

          Name  Score
School1  Alice     85
School2   Jack     82
School1  Helen     90

In [85]:
# Using the appropriate methods
# Make a copy of our data frame
# Then, drop school1 in that copy

In [86]:
df_copy = df.copy()
df_copy = df_copy.drop("School1")
df_copy

         Name      Class  Score
School2  Jack  Chemistry     82

In [89]:
# Let's do the same, with a second copy.
# This time, drop the name column, both in the copy, and in the original
# Do both drops in the same line
df_copy2 = df.copy()
df_copy2 = df.drop("Name", inplace=True, axis=1)
df, df_copy2

(             Class  Score
 School1    Physics     85
 School2  Chemistry     82
 School1    Biology     90,
 None)

In [96]:
# Drop the class column in our original dataframe using the del keywork

In [97]:
del df["Class"]

In [99]:
# Add a new column to our original dataframe. call it Class ranking and set it to none

In [102]:
df["Class ranking"] = None
df

         Score Class ranking
School1     85          None
School2     82          None
School1     90          None

         Score Class ranking
School1     85          None
School2     82          None
School1     90          None